Documents/ПротоколИспытаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПротоколИспытаний</Name>
			<BasedOn>
				<xr:Item>Document.Списание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОИсследованиях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Списание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИспытания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемВыборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктОтбораПроб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведенияИспытаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБракованныхУЕ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вывод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытанияПроизвел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал3</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал3</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал4</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал4</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал5</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал5</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал6</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал6</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал71</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал71</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал72</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал72</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал8</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал8</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал9</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал9</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал91</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал91</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал10</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Журнал10</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРозлива</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияПроведенияИспытаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоказателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияИспытаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНачалеИспытания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКонцеИспытания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияОИОиСИ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеИОиСИ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОборудованиеЛаборатории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействительныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МассаБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаПустойУпаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаПродукта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействительныйОбъем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммаПроведенияИспытаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеОбъектаИспытаний</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПА</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормированноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическиеПоказатели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводОСоответствии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Соответствие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СведенияОИсследованиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СведенияОИсследованиях</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Органолептика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганолептикаСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Списание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Арбитраж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АрбитражСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Списание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколИспытаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколИспытанийСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПротоколИспытаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтсатусИспытаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусИспытаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Производство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПротоколИспытаний/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Списание") Тогда
			//Автор = ДанныеЗаполнения.Автор;
			Комментарий = ДанныеЗаполнения.Комментарий;
			МестоОтбораПроб = ДанныеЗаполнения.ОбъектПроизводства;
			АктОтбораПроб = Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy");
			ДокументОтбораПроб = ДанныеЗаполнения.Ссылка;
			ДатаПроведенияИспытаний = ДанныеЗаполнения.Ссылка.Дата+120;
			ТНПА = ДанныеЗаполнения.ТНПА;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СписаниеПробы.НаименованиеПроб КАК НаименованиеПроб,
			|	СписаниеПробы.ВеличинаПартии КАК ВеличинаПартии,
			|	СписаниеПробы.ДатаРозлива КАК ДатаРозлива,
			|	СписаниеПробы.НомерПартии КАК НомерПартии,
			|	СписаниеПробы.ЦельИсследования.Наименование КАК ПодстрокаОрган,
			|	СписаниеПробы.ВесПробы КАК ВесПробы,
			|	СписаниеПробы.ДатаИзготовления КАК ДатаИзготовления,
			|	СписаниеПробы.ТНПАНаОтборПроб КАК ТНПАНаОтборПроб,
			|	СписаниеПробы.ТНПА1 КАК ТНПА1,
			|	СписаниеПробы.НаименованиеПроб.ВидУпаковки.Наименование КАК НаименованиеПробВидУпаковкиНаименование
			|ИЗ
			|	Документ.Списание.Пробы КАК СписаниеПробы
			|ГДЕ
			|	СписаниеПробы.Ссылка = &ДанныеЗаполненияСсылка
			|	И ПОДСТРОКА(СписаниеПробы.ЦельИсследования.Наименование, 0, 5) = &НаименованиеЦели";
			
			Запрос.УстановитьПараметр("ДанныеЗаполненияСсылка", ДанныеЗаполнения.Ссылка);
			Запрос.УстановитьПараметр("НаименованиеЦели", "Орган");
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектИспытания = ВыборкаДетальныеЗаписи.НаименованиеПроб;
				РазмерПартии = ВыборкаДетальныеЗаписи.ВеличинаПартии;
				ОбъемВыборки = ВыборкаДетальныеЗаписи.ВесПробы;
				НомерПартии = ВыборкаДетальныеЗаписи.НомерПартии;
				ДатаИзготовления = ВыборкаДетальныеЗаписи.ДатаИзготовления;
				ДатаРозлива = ВыборкаДетальныеЗаписи.ДатаРозлива;
				ВидУпаковки = ВыборкаДетальныеЗаписи.НаименованиеПробВидУпаковкиНаименование;
				ТНПА = ВыборкаДетальныеЗаписи.ТНПА1;
				ТНПА2 = ВыборкаДетальныеЗаписи.ТНПАНаОтборПроб;
			КонецЦикла;
			
			
			
			
		КонецЕсли;
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		// регистр СведенияОИсследованиях
		Набор = РегистрыСведений.СведенияОИсследованиях.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументОтбораПроб.ВыпускПродукции.Ссылка);
		Набор.Прочитать();
		Для Каждого Запись Из Набор Цикл 
			Запись.ПротоколИспытаний= Истина;
			Запись.ПротоколИспытанийСсылка = Ссылка;
			Запись.СтсатусИспытаний = ОбщегоНазначенияСервер.ОпредлениеСтатусаИсследований(Запись.Арбитраж, Запись.Органолептика, Запись.ПротоколИспытаний);
			Если Набор.Модифицированность() Тогда
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецПроцедуры
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
